Revit 2024 API
VoltageTypeSetIterator Class
An iterator to a voltage type set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class VoltageTypeSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class VoltageTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class VoltageTypeSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
See Also
VoltageTypeSetIterator Members
Autodesk.Revit.DB.Electrical Namespace